app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        # instance variable
        @cats = Cat.all

INSERT INTO "cats" ("name", "created_at", "updated_at", "skill") VALUES (?, ?, ?, ?)  [["name", "Gizmo"], ["created_at", "2019-07-03 20:05:10.697759"], ["updated_at", "2019-07-03 20:05:10.697759"], ["skill", "Jumping"]]
---
    def create
        #{ "cat" : { "name": "Sally" }, "dog": {"name":"Bertrand"}}
        # @cat - instance variable
        @cat = Cat.new(cat_params)
        #cat.admin = false
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "cats" SET "skill" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["skill", "Meowing"], ["updated_at", "2019-07-05 21:40:23.162651"], ["id", 14]]
---
    def update
        @cat = Cat.find(params[:id])
        # .permit())
        # attributes not on this list will be ignored
        if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def edit
        # /cats/:id/edit
        # show a form to edit
        @cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 13]]
---
    def destroy
        # DELETE /cats/:id
       cat = Cat.find(params[:id])
       cat.destroy