app/controllers/toys_controller.rb

SELECT "toys".* FROM "toys"
---
    def index
        render json: Toy.all