app/controllers/toys_controller.rb

SELECT "toys".* FROM "toys"
---
    def show
        # /cats/:cat_id/toys/:id
        # toys/:id
        render json: Toy.find[params[:id]]

INSERT INTO "toys" ("cat_id", "name", "ttype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cat_id", 14], ["name", "Big Ball"], ["ttype", "yarnball"], ["created_at", "2019-07-05 21:06:02.649445"], ["updated_at", "2019-07-05 21:06:02.649445"]]
---
    def create
        # POST /cats/:cat_id/toys
        # POST /toys
        #self.params method => returns an object of parameters
        #HashWithIndiffentAccess < Hash
        # whitelist
        # strong parameters
        # toy = Toy.new(params[:toy].permit(:cat_id, :name, :ttype))
        # because protected method
        @toy = Toy.new(self.toy_params)
        @cat = @toy.cat
        # can also say Cat.find(params[:toy][:cat_id]) #=> @toy.cat
        # toy.cat_id = params[:cat_id]
            #cat_id: params[:toy][:cat_id],
            #name: params[:toy][:name],
            #ttype: params[:toy][:ttype]
            #)

        if @toy.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def new
        @cat = Cat.find(params[:cat_id])