app/views/cats/index.html.erb

SELECT "cats".* FROM "cats"
---
                 app.cat_url()
                 Cat.first