app/views/cats/show.html.erb

    <!-- @cat not @cats -->
    <% @cat.toys.each do |toy| %>
---
SELECT "toys".* FROM "toys" WHERE "toys"."cat_id" = ?  [["cat_id", 5]]